**** #4.3 Observe the load imbalance

Verify a file ~mandelbrot.slurm_JOBID.out~.

Observe the compute time per rank.

#+begin_src shell :results both :export both
ssh gppd-hpc.inf.ufrgs.br "cat mandelbrot.slurm_58943.out | grep Compute | head -n10"
#+end_src

#+RESULTS:
#+begin_example
[3] Compute OKAY 0.546264 secs
[4] Compute OKAY 0.579614 secs
[5] Compute OKAY 0.600088 secs
[6] Compute OKAY 0.652515 secs
[9] Compute OKAY 0.626929 secs
[8] Compute OKAY 0.650330 secs
[7] Compute OKAY 0.665047 secs
[10] Compute OKAY 0.647199 secs
[11] Compute OKAY 0.660925 secs
[12] Compute OKAY 0.654586 secs
#+end_example

**** #5.4 Update Makefile to link against akypuera

There is a new akypuera-enabled Makefile to compile all of them in an application:

#+BEGIN_SRC makefile :tangle Makefile.akypuera
CC = mpicc
CFLAGS = -O3 -g
LDFLAGS = -L$(HOME)/install/akypuera/lib/ -L$(HOME)/akypuera/lib/ -laky -lrastro
OBJ = timing_functions.o \
      compute_mandelbrot_coordinates.o \
      compute_one_mandelbrot_point.o \
      mandelbrot-mpi.o \

%.o:%.c
	$(CC) -c -o $@ $< $(CFLAGS)

mandelbrot-mpi: $(OBJ)
	$(CC) -o $@ $^ $(CFLAGS) $(LDFLAGS)

clean:
	rm -f *.o
#+END_SRC

To compile, do:

#+begin_src shell :results output :export
make clean
make -f Makefile.akypuera
#+end_src

#+RESULTS:
: rm -f *.o
: mpicc -c -o timing_functions.o timing_functions.c -O3 -g
: mpicc -c -o compute_mandelbrot_coordinates.o compute_mandelbrot_coordinates.c -O3 -g
: mpicc -c -o compute_one_mandelbrot_point.o compute_one_mandelbrot_point.c -O3 -g
: mpicc -c -o mandelbrot-mpi.o mandelbrot-mpi.c -O3 -g
: mpicc -o mandelbrot-mpi timing_functions.o compute_mandelbrot_coordinates.o compute_one_mandelbrot_point.o mandelbrot-mpi.o -O3 -g -L/home/schnorr/install/akypuera/lib -laky -lrastro

